# ViewAnalysisDisplayStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewAnalysisDisplayStyle Property
ParameterTypeId Class See Also
---
"Default Analysis Display Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewAnalysisDisplayStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewAnalysisDisplayStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewAnalysisDisplayStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace